<?php
function isAjax(){
	if(!empty($_SERVER['HTTP_X_REQUESTED_WITH']) && strtolower($_SERVER['HTTP_X_REQUESTED_WITH']) == 'xmlhttprequest')
		return true;


	return false;
}

function remove_symbols ( $string )
{
	$basic = 'a-zA-Z0-9';
	$utf8 = 'áàảãạăắặằẳẵâấầẩẫậđéèẻẽẹêếềểễệíìỉĩịóòỏõọôốồổỗộơớờởỡợúùủũụưứừửữựýỳỷỹỵÁÀẢÃẠĂẮẶẰẲẴÂẤẦẨẪẬĐÉÈẺẼẸÊẾỀỂỄỆÍÌỈĨỊÓÒỎÕỌÔỐỒỔỖỘƠỚỜỞỠỢÚÙỦŨỤƯỨỪỬỮỰÝỲỶỸỴ';
	$special = '()?!_"\-\'';
	$string = preg_replace( '/^[^'.$basic . $utf8 .'"space"]+/iu', '', $string );
	$string = preg_replace( '/[^'.$basic . $utf8 . $special . '"space"]+/iu', '', $string );
 	return $string;
}

function getYoutubeVideoId($iframeCode) {
	
	preg_match('/(?<=(?:v|i)=)[a-zA-Z0-9-]+(?=&)|(?<=(?:v|i)\/)[^&\n]+|(?<=embed\/)[^"&\n]+|(?<=‌​(?:v|i)=)[^&\n]+|(?<=youtu.be\/)[^&\n]+/', $iframeCode, $matches);
	
	if (!empty($matches)) {
		return $matches[0];
	}
	
	return '';
	
}


function convertAlias($cs)
{
	$temp = urlencode($cs);
	$maKhac = array("%E2%80%93","%CC%89","%CC%A3","%CC%80","%CC%81","%E2%82%AC","%C2%B8");
	$test = str_replace($maKhac,"",$temp);
	$cs = urldecode($test);
	
	$marTViet=array("à","á","ạ","ả","ã","â","ầ","ấ","ậ","ẩ","ẫ","ă",
	                "ằ","ắ","ặ","ẳ","ẵ","è","é","ẹ","ẻ","ẽ","ê","ề",
	                "ế","ệ","ể","ễ",
	                "ì","í","ị","ỉ","ĩ",
	                "ò","ó","ọ","ỏ","õ","ô","ồ","ố","ộ","ổ","ỗ","ơ",
	                "ờ","ớ","ợ","ở","ỡ",
	                "ù","ú","ụ","ủ","ũ","ư","ừ","ứ","ự","ử","ữ",
	                "ỳ","ý","ỵ","ỷ","ỹ",
	                "đ",
	                "À","Á","Ạ","Ả","Ã","Â","Ầ","Ấ","Ậ","Ẩ","Ẫ","Ă",
	                "Ằ","Ắ","Ặ","Ẳ","Ẵ",
	                "È","É","Ẹ","Ẻ","Ẽ","Ê","Ề","Ế","Ệ","Ể","Ễ",
	                "Ì","Í","Ị","Ỉ","Ĩ",
	                "Ò","Ó","Ọ","Ỏ","Õ","Ô","Ồ","Ố","Ộ","Ổ","Ỗ","Ơ","Ờ","Ớ","Ợ","Ở","Ỡ",
	                "Ù","Ú","Ụ","Ủ","Ũ","Ư","Ừ","Ứ","Ự","Ử","Ữ",
	                "Ỳ","Ý","Ỵ","Ỷ","Ỹ",
	                "Đ"," ",".",",","(",")","/","\\","*","&","@","$","%","^","#","!","amp;","'",'"',"“","”","quot;","gt;","lt;",";","?","-",
					"`","'","‘","’",":","_","+","=","~","<",">","|","[","]","{","}");


	$marKoDau=array("a","a","a","a","a","a","a","a","a","a","a",
	                "a","a","a","a","a","a",
	                "e","e","e","e","e","e","e","e","e","e","e",
	                "i","i","i","i","i",
	                "o","o","o","o","o","o","o","o","o","o","o","o",
	                "o","o","o","o","o",
	                "u","u","u","u","u","u","u","u","u","u","u",
	                "y","y","y","y","y",
	                "d",
	                "A","A","A","A","A","A","A","A","A","A","A","A",
	                "A","A","A","A","A",
	                "E","E","E","E","E","E","E","E","E","E","E",
	                "I","I","I","I","I",
	                "O","O","O","O","O","O","O","O","O","O","O","O","O","O","O","O","O",
	                "U","U","U","U","U","U","U","U","U","U","U",
	                "Y","Y","Y","Y","Y",
	                "D","-","","","","","","","","","","","","","","","","","","","","","","","","","-",
					"","","","","","","","","","","","","","","","");


	return strtolower(str_replace($marTViet,$marKoDau,$cs));
}

function getBrandModule($cs)
{
	$marTViet=array("à","á","ạ","ả","ã","â","ầ","ấ","ậ","ẩ","ẫ","ă",
	                "ằ","ắ","ặ","ẳ","ẵ","è","é","ẹ","ẻ","ẽ","ê","ề",
	                "ế","ệ","ể","ễ",
	                "ì","í","ị","ỉ","ĩ",
	                "ò","ó","ọ","ỏ","õ","ô","ồ","ố","ộ","ổ","ỗ","ơ",
	                "ờ","ớ","ợ","ở","ỡ",
	                "ù","ú","ụ","ủ","ũ","ư","ừ","ứ","ự","ử","ữ",
	                "ỳ","ý","ỵ","ỷ","ỹ",
	                "đ",
	                "À","Á","Ạ","Ả","Ã","Â","Ầ","Ấ","Ậ","Ẩ","Ẫ","Ă",
	                "Ằ","Ắ","Ặ","Ẳ","Ẵ",
	                "È","É","Ẹ","Ẻ","Ẽ","Ê","Ề","Ế","Ệ","Ể","Ễ",
	                "Ì","Í","Ị","Ỉ","Ĩ",
	                "Ò","Ó","Ọ","Ỏ","Õ","Ô","Ồ","Ố","Ộ","Ổ","Ỗ","Ơ","Ờ","Ớ","Ợ","Ở","Ỡ",
	                "Ù","Ú","Ụ","Ủ","Ũ","Ư","Ừ","Ứ","Ự","Ử","Ữ",
	                "Ỳ","Ý","Ỵ","Ỷ","Ỹ",
	                "Đ"," ",".",",","(",")","/","\\","*","&","@","$","%","^","#","!","amp;",'"',"“","”");


	$marKoDau=array("a","a","a","a","a","a","a","a","a","a","a",
	                "a","a","a","a","a","a",
	                "e","e","e","e","e","e","e","e","e","e","e",
	                "i","i","i","i","i",
	                "o","o","o","o","o","o","o","o","o","o","o","o",
	                "o","o","o","o","o",
	                "u","u","u","u","u","u","u","u","u","u","u",
	                "y","y","y","y","y",
	                "d",
	                "A","A","A","A","A","A","A","A","A","A","A","A",
	                "A","A","A","A","A",
	                "E","E","E","E","E","E","E","E","E","E","E",
	                "I","I","I","I","I",
	                "O","O","O","O","O","O","O","O","O","O","O","O","O","O","O","O","O",
	                "U","U","U","U","U","U","U","U","U","U","U",
	                "Y","Y","Y","Y","Y",
	                "D","","","","","","","","","","","","","","","","","","","");


	return strtolower(str_replace($marTViet,$marKoDau,$cs));
}
?>